eir_hosted_office.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cai3="http://schemas.ericsson.com/cai3g1.2/">
<soapenv:Header xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cai3="http://schemas.ericsson.com/cai3g1.2/">
      <cai3:TransactionI>69518046</cai3:TransactionI>
      <cai3:SessionId>a8c00c01a8c00c01000000001441291382232</cai3:SessionId>
</soapenv:Header><soapenv:Body>
<cai3:Create xmlns:cai3="http://schemas.ericsson.com/cai3g1.2/"><ns1:MOType xmlns:ns1="http://schemas.ericsson.com/cai3g1.2/">IMSSubscription@http://schemas.ericsson.com/ema/UserProvisioning/IMS/5.0/</ns1:MOType>
<cai3:MOId>
<subscriberId>+353766909939@ngv.eircom.net</subscriberId>
</cai3:MOId>
<cai3:MOAttributes>
<createIMSSubscription>
<subscriberId>+353766909939@ngv.eircom.net</subscriberId>
<subscriberBarringInd>FALSE</subscriberBarringInd>
<defaultPrivateId>+353766909939@ngv.eircom.net</defaultPrivateId>
<chargingProfId>HostedOfficeChargingProfile</chargingProfId>
<privacyIndicator>FALSE</privacyIndicator>
<pubData>
  <publicIdValue>sip:+353766909939@ngv.eircom.net</publicIdValue>
  <privateUserId>+353766909939@ngv.eircom.net</privateUserId>
  <publicIdTelValue>tel:+353766909939</publicIdTelValue>
  <xcapAllowed>FALSE</xcapAllowed>
  <implicitRegSet>1</implicitRegSet>
  <isDefault>TRUE</isDefault>
  <configuredServiceProfiles>
    <configuredServiceProfileId>ho_orig_retail</configuredServiceProfileId>
  </configuredServiceProfiles>
  <configuredServiceProfiles>
    <configuredServiceProfileId>ho_term_retail</configuredServiceProfileId>
  </configuredServiceProfiles>
</pubData>
<pubData>
  <publicIdValue>sip:+353766909939_sca_d@ngv.eircom.net</publicIdValue>
  <xcapAllowed>FALSE</xcapAllowed>
  <implicitRegSet>2</implicitRegSet>
  <isDefault>TRUE</isDefault>
  <configuredServiceProfiles>
    <configuredServiceProfileId>ho_orig_retail</configuredServiceProfileId>
  </configuredServiceProfiles>
  <configuredServiceProfiles>
    <configuredServiceProfileId>ho_term_retail</configuredServiceProfileId>
  </configuredServiceProfiles>
</pubData>
<pubData>
  <publicIdValue>sip:+353766909939_sca_m@ngv.eircom.net</publicIdValue>
  <xcapAllowed>FALSE</xcapAllowed>
  <implicitRegSet>3</implicitRegSet>
  <isDefault>TRUE</isDefault>
  <configuredServiceProfiles>
    <configuredServiceProfileId>ho_orig_retail</configuredServiceProfileId>
  </configuredServiceProfiles>
  <configuredServiceProfiles>
    <configuredServiceProfileId>ho_term_retail</configuredServiceProfileId>
  </configuredServiceProfiles>
</pubData>
<pubData>
  <publicIdValue>sip:+353766909939_sca_t@ngv.eircom.net</publicIdValue>
  <xcapAllowed>FALSE</xcapAllowed>
  <implicitRegSet>4</implicitRegSet>
  <isDefault>TRUE</isDefault>
  <configuredServiceProfiles>
    <configuredServiceProfileId>ho_orig_retail</configuredServiceProfileId>
  </configuredServiceProfiles>
  <configuredServiceProfiles>
    <configuredServiceProfileId>ho_term_retail</configuredServiceProfileId>
  </configuredServiceProfiles>
</pubData>
<pubData>
  <publicIdValue>sip:+353766909939_sca_1@ngv.eircom.net</publicIdValue>
  <xcapAllowed>FALSE</xcapAllowed>
  <implicitRegSet>5</implicitRegSet>
  <isDefault>TRUE</isDefault>
  <configuredServiceProfiles>
    <configuredServiceProfileId>ho_orig_retail</configuredServiceProfileId>
  </configuredServiceProfiles>
  <configuredServiceProfiles>
    <configuredServiceProfileId>ho_term_retail</configuredServiceProfileId>
  </configuredServiceProfiles>
</pubData>
<pubData>
  <publicIdValue>sip:+353766909939_sca_2@ngv.eircom.net</publicIdValue>
  <xcapAllowed>FALSE</xcapAllowed>
  <implicitRegSet>6</implicitRegSet>
  <isDefault>TRUE</isDefault>
  <configuredServiceProfiles>
    <configuredServiceProfileId>ho_orig_retail</configuredServiceProfileId>
  </configuredServiceProfiles>
  <configuredServiceProfiles>
    <configuredServiceProfileId>ho_term_retail</configuredServiceProfileId>
  </configuredServiceProfiles>
</pubData>
<pubData>
  <publicIdValue>sip:+353766909939_sca_3@ngv.eircom.net</publicIdValue>
  <xcapAllowed>FALSE</xcapAllowed>
  <implicitRegSet>7</implicitRegSet>
  <isDefault>TRUE</isDefault>
  <configuredServiceProfiles>
    <configuredServiceProfileId>ho_orig_retail</configuredServiceProfileId>
  </configuredServiceProfiles>
  <configuredServiceProfiles>
    <configuredServiceProfileId>ho_term_retail</configuredServiceProfileId>
  </configuredServiceProfiles>
</pubData>
<pubData>
  <publicIdValue>sip:+353766909939_sca_4@ngv.eircom.net</publicIdValue>
  <xcapAllowed>FALSE</xcapAllowed>
  <implicitRegSet>8</implicitRegSet>
  <isDefault>TRUE</isDefault>
  <configuredServiceProfiles>
    <configuredServiceProfileId>ho_orig_retail</configuredServiceProfileId>
  </configuredServiceProfiles>
  <configuredServiceProfiles>
    <configuredServiceProfileId>ho_term_retail</configuredServiceProfileId>
  </configuredServiceProfiles>
</pubData>
<pubData>
  <publicIdValue>sip:+353766909939_sca_5@ngv.eircom.net</publicIdValue>
  <xcapAllowed>FALSE</xcapAllowed>
  <implicitRegSet>9</implicitRegSet>
  <isDefault>TRUE</isDefault>
  <configuredServiceProfiles>
    <configuredServiceProfileId>ho_orig_retail</configuredServiceProfileId>
  </configuredServiceProfiles>
  <configuredServiceProfiles>
    <configuredServiceProfileId>ho_term_retail</configuredServiceProfileId>
  </configuredServiceProfiles>
</pubData>
<pubData>
  <publicIdValue>sip:+353766909939_sca_6@ngv.eircom.net</publicIdValue>
  <xcapAllowed>FALSE</xcapAllowed>
  <implicitRegSet>10</implicitRegSet>
  <isDefault>TRUE</isDefault>
  <configuredServiceProfiles>
    <configuredServiceProfileId>ho_orig_retail</configuredServiceProfileId>
  </configuredServiceProfiles>
  <configuredServiceProfiles>
    <configuredServiceProfileId>ho_term_retail</configuredServiceProfileId>
  </configuredServiceProfiles>
</pubData>
<pubData>
  <publicIdValue>sip:+353766909939_sca_7@ngv.eircom.net</publicIdValue>
  <xcapAllowed>FALSE</xcapAllowed>
  <implicitRegSet>11</implicitRegSet>
  <isDefault>TRUE</isDefault>
  <configuredServiceProfiles>
    <configuredServiceProfileId>ho_orig_retail</configuredServiceProfileId>
  </configuredServiceProfiles>
  <configuredServiceProfiles>
    <configuredServiceProfileId>ho_term_retail</configuredServiceProfileId>
  </configuredServiceProfiles>
</pubData>
<privateUser>
  <privateUserId>+353766909939@ngv.eircom.net</privateUserId>
 <userPassword>kq88U+BhPT61Ky</userPassword>
  <roamingAllowed>FALSE</roamingAllowed>
  <allowedAuthMechanism>Digest</allowedAuthMechanism>
</privateUser>
</createIMSSubscription>
</cai3:MOAttributes>
</cai3:Create>
</soapenv:Body>
</soapenv:Envelope>

