hss_create.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:cai3g="http://schemas.ericsson.com/cai3g1.2/" xmlns:sim="http://schemas.ericsson.com/ema/UserProvisioning/Ecms/SIM/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
<SOAP-ENV:Header>
	<cai3g:SequenceId>193796089649584960</cai3g:SequenceId>
	<cai3g:TransactionId>0000000</cai3g:TransactionId>
	<cai3g:SessionId>007f0100007f0100000000001573933457545</cai3g:SessionId>
</SOAP-ENV:Header>

<SOAP-ENV:Body>
	<cai3g:Create>
	<cai3g:MOType>EPSMultiSC@http://schemas.ericsson.com/ma/HSS/</cai3g:MOType>
	<cai3g:MOId>
		<msisdn>245966601924</msisdn>
	</cai3g:MOId>
	<cai3g:MOAttributes>
		<CreateEPSMultiSC imsi="632020105135628"><imsi>632020105135628</imsi>
			<msisdn>245966601924</msisdn>
			<subscriptionId>245966601924</subscriptionId>
			<epsProfileId>2</epsProfileId>
			<epsRoamingAllowed>TRUE</epsRoamingAllowed>
			<epsRoamingRestriction>FALSE</epsRoamingRestriction>
		</CreateEPSMultiSC>
	</cai3g:MOAttributes></cai3g:Create>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
